ib2b-documentation/output/services/managespinventory/updateInventory/Normal - Inventory Updated (NSAS)/00_updateInventoryRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
	@operation updateInventory
	@action requestInventoryAmend
	@sender EPS
	@receiver FLS
	@scenario Amend inventory (NSAS)
	@name Normal - Amend inventory
	@description This is a sample request message for the scenario: Inventory amended for NSAS.
	@version V1.0
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
	xmlns:dns="http://www.nbnco.com.au/cim/manageSPInventory/v5"
	xmlns:mhe="http://www.nbnco.com.au/cim/common/messageHeader/v3">
	<soapenv:Header>
		<mhe:MessageHeader>
			<activityName>updateInventory</activityName>
			<msgName>ManageSPInventoryupdateInventoryRequest</msgName>
			<businessServiceName>ManageSPInventory</businessServiceName>
			<businessServiceVersion>V1.0</businessServiceVersion>
			<msgType>Request</msgType>
			<accessSeekerID>SDP000000000001</accessSeekerID>
			<correlationId>4eef4405-606e-46db-8c5c-af78e2874077</correlationId>
			<security>Placeholder Security</security>
			<priority>6</priority>
			<communicationPattern>RequestReply</communicationPattern>
			<timestamp>2014-08-18T12:00:01Z</timestamp>
			<businessChannel>B2B</businessChannel>
			<HeaderCharacteristicValue>
				<value>FALSE</value>
				<Characteristic>
					<name>Mocked</name>
				</Characteristic>
			</HeaderCharacteristicValue>
			<!-- The B2B gateway may send multiple (undefined) characteristics that should be echoed back in the response from Fulfilment -->
			<HeaderCharacteristicValue>
				<value>EPS-NBNCO-PROD-0004</value>
				<Characteristic>
					<name>cpaId</name>
					<type>String</type>
				</Characteristic>
			</HeaderCharacteristicValue>
			<HeaderCharacteristicValue>
				<value>SDP000000000001</value>
				<Characteristic>
					<name>fromPartner</name>
					<type>String</type>
				</Characteristic>
			</HeaderCharacteristicValue>
		</mhe:MessageHeader>
	</soapenv:Header>
	<soapenv:Body>
		<dns:ManageSPInventoryRequest>
			<SPInventory>
				<ID>ORD000000000001</ID>
				<interactionDate>2014-08-18T12:00:00.000Z</interactionDate>
				<SPInventoryComprisedOf>
					<!-- NSAS -->
					<ItemInvolvesProduct>
						<type>NSAS</type>
					</ItemInvolvesProduct>
					<!-- Below are the attributes that are changing. Also need to specify enough ids to make the tree complete for lower level items (TBD) -->
					<!-- TBD not sure if actions are relevant? -->
					<!-- Example here is pretty much all attributes changing (unlikely) -->
					<ReferencesSPInventoryItem>
						<action>ADD</action>
						<ItemInvolvesResource>
							<ID>NTD000000000001</ID>
							<DescribedBy>
								<value>1 Port</value>
								<Characteristic>
									<ID>ntdType</ID>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>1A</value>
								<Characteristic>
									<ID>satelliteId</ID>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>1</value>
								<Characteristic>
									<ID>beamId</ID>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>1</value>
								<Characteristic>
									<ID>rfcId</ID>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>LOC000000000001</value>
								<Characteristic>
									<ID>locationId</ID>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>CSA000000000001</value>
								<Characteristic>
									<ID>csaId</ID>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>10</value>
								<Characteristic>
									<ID>terminalType</ID>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>-37.675</value>
								<Characteristic>
									<ID>latitude</ID>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>144.8</value>
								<Characteristic>
									<ID>longitude</ID>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>PENDING</value>
								<Characteristic>
									<ID>ntdState</ID>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>NEW INSTALLATION</value>
								<Characteristic>
									<ID>ntdStateDescription</ID>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>hardwareVersion</ID>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>firmwareVersion</ID>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>ntdMacAddress</ID>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>In-door Unit Serial Number</value>
								<Characteristic>
									<ID>iduSerialNumber</ID>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>Out-door Unit Serial Number</value>
								<Characteristic>
									<ID>oduSerialNumber</ID>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>AC</value>
								<Characteristic>
									<ID>ntdPowerType</ID>
								</Characteristic>
							</DescribedBy>
							<!-- Either 80 cm, 120 cm or 180 cm -->
							<DescribedBy>
								<value>180 cm</value>
								<Characteristic>
									<ID>oduAntennaSize</ID>
								</Characteristic>
							</DescribedBy>
							<!-- Either 3W or 6W -->
							<DescribedBy>
								<value>6W</value>
								<Characteristic>
									<ID>oduTriaType</ID>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>oduMountType</ID>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>ntdInstallationKey</ID>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>1.1.1.1</value>
								<Characteristic>
									<ID>ntdIpAddress</ID>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>qoiStatus</ID>
									<type>NTD QoI Data</type>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>oduStatus</ID>
									<type>NTD QoI Data</type>
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>rlSymbolRate</ID>
									<type>NTD QoI Data</type>									
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>minRlSymbolRate</ID>
									<type>NTD QoI Data</type>									
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>flSnr</ID>
									<type>NTD QoI Data</type>									
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>maxFlSnr</ID>
									<type>NTD QoI Data</type>									
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>minFlSnr</ID>
									<type>NTD QoI Data</type>									
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>iflCableLoss</ID>
									<type>NTD QoI Data</type>									
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>maxIflCableLoss</ID>
									<type>NTD QoI Data</type>									
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>minIflCableLoss</ID>
									<type>NTD QoI Data</type>									
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>iflCableConsistency</ID>
									<type>NTD QoI Data</type>									
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>maxIflCableConsistency</ID>
									<type>NTD QoI Data</type>									
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>minIflCableConsistency</ID>
									<type>NTD QoI Data</type>									
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>iflCableResistance</ID>
									<type>NTD QoI Data</type>									
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>maxIflCableResistance</ID>
									<type>NTD QoI Data</type>									
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>minIflCableResistance</ID>
									<type>NTD QoI Data</type>									
								</Characteristic>
							</DescribedBy>
							<DescribedBy>
								<value>FLS or Ericsson to provide sample value</value>
								<Characteristic>
									<ID>actionCode</ID>
									<type>NTD QoI Data</type>									
								</Characteristic>
							</DescribedBy>
							<type>NTD</type>
						</ItemInvolvesResource>
						<ReferencesSPInventoryItem>
							<action>ADD</action>
							<ItemInvolvesResource>
								<ID>UNI000000000001</ID>
								<DescribedBy>
									<value>1</value>
									<Characteristic>
										<ID>portNumber</ID>
									</Characteristic>
								</DescribedBy>
								<DescribedBy>
									<value>DEFAULT_MAPPED</value>
									<Characteristic>
										<ID>interfaceMode</ID>
									</Characteristic>
								</DescribedBy>
								<DescribedBy>
									<value>TEN_MBPS</value>
									<Characteristic>
										<ID>ethernetRate</ID>
									</Characteristic>
								</DescribedBy>
								<DescribedBy>
									<value>HALF</value>
									<Characteristic>
										<ID>ethernetDuplex</ID>
									</Characteristic>
								</DescribedBy>
								<DescribedBy>
									<value>FAULTED</value>
									<Characteristic>
										<ID>portOpStatus</ID>
									</Characteristic>
								</DescribedBy>
								<type>UNID</type>
							</ItemInvolvesResource>
							<ReferencesSPInventoryItem>
								<action>ADD</action>
								<ItemInvolvesService>
									<ID>AVC000000000001</ID>
									<DescribedBy>
										<value>CVC000000000001</value>
										<Characteristic>
											<ID>cvcId</ID>
										</Characteristic>
									</DescribedBy>
									<DescribedBy>
										<value>FLS or Ericsson to provide sample value</value>
										<Characteristic>
											<ID>lineId</ID>
										</Characteristic>
									</DescribedBy>
									<DescribedBy>
										<value>False</value>
										<Characteristic>
											<ID>enableEncryption</ID>
										</Characteristic>
									</DescribedBy>
									<DescribedBy>
										<value>FLS or Ericsson to provide sample value</value>
										<Characteristic>
											<ID>uniVlan</ID>
										</Characteristic>
									</DescribedBy>
									<DescribedBy>
										<value>Bandwidth 1 (FLS or Ericsson to provide sample value)</value>
										<Characteristic>
											<ID>bandwidthProfile</ID>
										</Characteristic>
									</DescribedBy>
									<DescribedBy>
										<value>1</value>
										<Characteristic>
											<ID>sTagVid</ID>
										</Characteristic>
									</DescribedBy>
									<DescribedBy>
										<value>AVC000000000002</value>
										<Characteristic>
											<ID>associatedUnicastAvcId</ID>
										</Characteristic>
									</DescribedBy>
									<type>AVCM</type>
								</ItemInvolvesService>						
							</ReferencesSPInventoryItem>
						</ReferencesSPInventoryItem>
					</ReferencesSPInventoryItem>
				</SPInventoryComprisedOf>
			</SPInventory>
		</dns:ManageSPInventoryRequest>
	</soapenv:Body>
</soapenv:Envelope>